In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
a = (1,2,3,4,5,6)

b = ["One","Two","Three","Four","Five","Six"]

x = pd.Series(data = b)
x

0      One
1      Two
2    Three
3     Four
4     Five
5      Six
dtype: object

In [4]:
y = pd.Series(data = a, index=b, dtype = str)
y

One      1
Two      2
Three    3
Four     4
Five     5
Six      6
dtype: object

In [5]:
z = pd.Series(data = b, index = a, dtype = str)
z

1      One
2      Two
3    Three
4     Four
5     Five
6      Six
dtype: object

In [6]:
a = [1,2,3,4,5]
b = ("One", "Two", "Three", "Four", "Five")
s = pd.Series(data= a, index = b, dtype = int)
s

One      1
Two      2
Three    3
Four     4
Five     5
dtype: int32

In [7]:
s.index

Index(['One', 'Two', 'Three', 'Four', 'Five'], dtype='object')

In [8]:
s["Four"]

4

In [9]:
data = pd.Series([1,2,3,4.6])
data

0    1.0
1    2.0
2    3.0
3    4.6
dtype: float64

In [10]:
data[::-1]

3    4.6
2    3.0
1    2.0
0    1.0
dtype: float64

In [11]:
data[-2]

KeyError: -2

In [12]:
a = [1,2,3,4]

In [13]:
a[-3]

2

In [14]:
data[2:4]

2    3.0
3    4.6
dtype: float64

In [15]:
emp = {"A":8, "B":9, "C":10}

details = pd.Series(emp)

details

A     8
B     9
C    10
dtype: int64

In [16]:
age = {"ram":25, "bob":19, "cam":22}
s = pd.Series(data = age, index = ["bob", "ram", "cam", "hello"], dtype = int)
s

bob      19.0
ram      25.0
cam      22.0
hello     NaN
dtype: float64

In [17]:
import pandas as pd
population_dict ={  "California": 38451245,
                    "Texas": 26448193,
                    "New York": 192543,
                    "Florida": 451683,
                    "Florida": 238416,
                    "Illinois": 12985438,
                    "Illinois": 452891}
population_series = pd.Series(population_dict)
population_series

California    38451245
Texas         26448193
New York        192543
Florida         238416
Illinois        452891
dtype: int64

In [18]:
population_series["Texas":"Illinois"]

Texas       26448193
New York      192543
Florida       238416
Illinois      452891
dtype: int64

In [19]:
population_dict.keys()

dict_keys(['California', 'Texas', 'New York', 'Florida', 'Illinois'])

In [20]:
population_dict.values()

dict_values([38451245, 26448193, 192543, 238416, 452891])

In [21]:
population_series["New York"]

192543

In [22]:
pd.Series([2,3,4])

0    2
1    3
2    4
dtype: int64

In [23]:
area_dict = {"Califirnia": 423967,
             "Texas": 452318,
             "New York": 563271,
             "Florida": 524137,
             "Illinois": 624183}
area_series = pd.Series(area_dict)
area_series

Califirnia    423967
Texas         452318
New York      563271
Florida       524137
Illinois      624183
dtype: int64

In [24]:
states = pd.DataFrame
({"population":population_series, "area":area_series})
states

pandas.core.frame.DataFrame

In [25]:
data = [["A",34,23,56],["B",92,88,78],["C",76, " ",25],["D"," ", 78,99]]
stu = pd.DataFrame(data, columns=["Name", "Maths","Phy","Chem"], index=[1,2,3,4])
stu

  Name Maths Phy  Chem
1    A    34  23    56
2    B    92  88    78
3    C    76        25
4    D        78    99

In [26]:
stu["Phy"]

1    23
2    88
3
4    78
Name: Phy, dtype: object

In [27]:
type(stu)

pandas.core.frame.DataFrame

In [28]:
type(stu["Phy"])

pandas.core.series.Series

In [30]:
stu["Phy", "Maths"]

KeyError: ('Phy', 'Maths')

In [31]:
stu[["Phy", "Maths", "Chem"]]

  Phy Maths  Chem
1  23    34    56
2  88    92    78
3        76    25
4  78          99

In [45]:
#series = 1D
#DataFrame = 2D

In [32]:
stu["Name"]

1    A
2    B
3    C
4    D
Name: Name, dtype: object

In [33]:
stu["Phy"]

1    23
2    88
3
4    78
Name: Phy, dtype: object

In [34]:
stu.replace(" ",0)

  Name  Maths  Phy  Chem
1    A     34   23    56
2    B     92   88    78
3    C     76    0    25
4    D      0   78    99

In [35]:
import pandas as pd

d = {'Chem' : pd.Series([30, 70, 35,25,26,67,77,67,89], index=["Raj",'Ram', 'Asa', 'Pi','Chi','Ru',"Sita","Ria","Gita"],dtype=int),
     'Math' : pd.Series([18, 26, 35, 40,55,89,79,100], index=["Raj",'Ram', 'Pi', 'Chi', 'Ru',"Sita","Ria","Gita"],dtype=int),
     'Phy' : pd.Series([31, 42, 83,34,80,78], index=["Asa",'Ram', 'Pi', 'Ru',"Sita","Gita"],dtype=int)}

exam = pd.DataFrame(d)
exam1=exam.copy() ## To make copy of your data
exam1

      Chem   Math   Phy
Asa     35    NaN  31.0
Chi     26   40.0   NaN
Gita    89  100.0  78.0
Pi      25   35.0  83.0
Raj     30   18.0   NaN
Ram     70   26.0  42.0
Ria     67   79.0   NaN
Ru      67   55.0  34.0
Sita    77   89.0  80.0

In [36]:
import pandas as pd

print ("Adding a new column using the existing columns in DataFrame:")

exam1['Total'] = exam1['Chem']+exam1['Math']+exam1['Phy']
exam1

Adding a new column using the existing columns in DataFrame:

      Chem   Math   Phy  Total
Asa     35    NaN  31.0    NaN
Chi     26   40.0   NaN    NaN
Gita    89  100.0  78.0  267.0
Pi      25   35.0  83.0  143.0
Raj     30   18.0   NaN    NaN
Ram     70   26.0  42.0  138.0
Ria     67   79.0   NaN    NaN
Ru      67   55.0  34.0  156.0
Sita    77   89.0  80.0  246.0

In [37]:
import pandas as pd


data = {'col1': [1,2,3,4], 'col2': [5,6,7,8], 'col3': ['a','b','c','d']}
df = pd.DataFrame(data)

selected_column = df['col2']

print(selected_column)

0    5
1    6
2    7
3    8
Name: col2, dtype: int64

In [38]:
exam1.isnull().sum()

Chem     0
Math     1
Phy      3
Total    4
dtype: int64

In [39]:
exam.fillna(0)

      Chem   Math   Phy
Asa     35    0.0  31.0
Chi     26   40.0   0.0
Gita    89  100.0  78.0
Pi      25   35.0  83.0
Raj     30   18.0   0.0
Ram     70   26.0  42.0
Ria     67   79.0   0.0
Ru      67   55.0  34.0
Sita    77   89.0  80.0

In [40]:
exam1["Avg"] = (exam1["Math"] + exam1["Phy"] + exam1["Chem"])/3
exam1

      Chem   Math   Phy  Total        Avg
Asa     35    NaN  31.0    NaN        NaN
Chi     26   40.0   NaN    NaN        NaN
Gita    89  100.0  78.0  267.0  89.000000
Pi      25   35.0  83.0  143.0  47.666667
Raj     30   18.0   NaN    NaN        NaN
Ram     70   26.0  42.0  138.0  46.000000
Ria     67   79.0   NaN    NaN        NaN
Ru      67   55.0  34.0  156.0  52.000000
Sita    77   89.0  80.0  246.0  82.000000

In [41]:
a = exam1["Math"].median()
a
exam1["Math"] = exam1["Math"].fillna(a)

In [42]:
exam1

      Chem   Math   Phy  Total        Avg
Asa     35   47.5  31.0    NaN        NaN
Chi     26   40.0   NaN    NaN        NaN
Gita    89  100.0  78.0  267.0  89.000000
Pi      25   35.0  83.0  143.0  47.666667
Raj     30   18.0   NaN    NaN        NaN
Ram     70   26.0  42.0  138.0  46.000000
Ria     67   79.0   NaN    NaN        NaN
Ru      67   55.0  34.0  156.0  52.000000
Sita    77   89.0  80.0  246.0  82.000000

In [43]:
exam1["Chem"].median()

67.0

In [44]:
b = exam1["Phy"].median()
b
b = exam1["Phy"] = exam1["Phy"].fillna(b)

exam1

      Chem   Math   Phy  Total        Avg
Asa     35   47.5  31.0    NaN        NaN
Chi     26   40.0  60.0    NaN        NaN
Gita    89  100.0  78.0  267.0  89.000000
Pi      25   35.0  83.0  143.0  47.666667
Raj     30   18.0  60.0    NaN        NaN
Ram     70   26.0  42.0  138.0  46.000000
Ria     67   79.0  60.0    NaN        NaN
Ru      67   55.0  34.0  156.0  52.000000
Sita    77   89.0  80.0  246.0  82.000000

In [45]:
exam1["Total_Cleaned"] = exam1["Math"]+exam1["Phy"]+exam1["Chem"]
exam1

      Chem   Math   Phy  Total        Avg  Total_Cleaned
Asa     35   47.5  31.0    NaN        NaN          113.5
Chi     26   40.0  60.0    NaN        NaN          126.0
Gita    89  100.0  78.0  267.0  89.000000          267.0
Pi      25   35.0  83.0  143.0  47.666667          143.0
Raj     30   18.0  60.0    NaN        NaN          108.0
Ram     70   26.0  42.0  138.0  46.000000          138.0
Ria     67   79.0  60.0    NaN        NaN          206.0
Ru      67   55.0  34.0  156.0  52.000000          156.0
Sita    77   89.0  80.0  246.0  82.000000          246.0

In [46]:
exam1
exam1=exam1.dropna()

In [47]:
exam1

      Chem   Math   Phy  Total        Avg  Total_Cleaned
Gita    89  100.0  78.0  267.0  89.000000          267.0
Pi      25   35.0  83.0  143.0  47.666667          143.0
Ram     70   26.0  42.0  138.0  46.000000          138.0
Ru      67   55.0  34.0  156.0  52.000000          156.0
Sita    77   89.0  80.0  246.0  82.000000          246.0

In [51]:
exam.drop(["Total", axis == 1])

KeyError: "['Total', True] not found in axis"

In [52]:
exam1.drop(["Avg"], axis = 1)

      Chem   Math   Phy  Total  Total_Cleaned
Gita    89  100.0  78.0  267.0          267.0
Pi      25   35.0  83.0  143.0          143.0
Ram     70   26.0  42.0  138.0          138.0
Ru      67   55.0  34.0  156.0          156.0
Sita    77   89.0  80.0  246.0          246.0

In [53]:
exam1

      Chem   Math   Phy  Total        Avg  Total_Cleaned
Gita    89  100.0  78.0  267.0  89.000000          267.0
Pi      25   35.0  83.0  143.0  47.666667          143.0
Ram     70   26.0  42.0  138.0  46.000000          138.0
Ru      67   55.0  34.0  156.0  52.000000          156.0
Sita    77   89.0  80.0  246.0  82.000000          246.0

In [54]:
exam1.drop(["Total"], axis = 1, inplace= True)

C:\Users\Parag\AppData\Local\Temp\ipykernel_2816\3775029828.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  exam1.drop(["Total"], axis = 1, inplace= True)

In [55]:
exam1

      Chem   Math   Phy        Avg  Total_Cleaned
Gita    89  100.0  78.0  89.000000          267.0
Pi      25   35.0  83.0  47.666667          143.0
Ram     70   26.0  42.0  46.000000          138.0
Ru      67   55.0  34.0  52.000000          156.0
Sita    77   89.0  80.0  82.000000          246.0

In [57]:
df = pd.DataFrame({"One":[10,20,30,40,50, "ABC"],
                  "Age":[-19,23,42,14,18,19]})
df

   One  Age
0   10  -19
1   20   23
2   30   42
3   40   14
4   50   18
5  ABC   19

In [58]:
df_cleaned = df.replace({"ABC":60,-19:19})
df_cleaned

   One  Age
0   10   19
1   20   23
2   30   42
3   40   14
4   50   18
5   60   19

In [61]:
details = {"Brand":pd.Series(["Nokia", "Asus", "Vivo", "Oppo", "Samsung", "Apple", "MI"]),
          "Price":pd.Series([12000, 12500, 13000, 11000, 11500, 12400, 15000]),
          "Rating(10)":pd.Series([7,6.5,8,7,6,3,9])
        }
d = pd. DataFrame(details)
d

     Brand  Price  Rating(10)
0    Nokia  12000         7.0
1     Asus  12500         6.5
2     Vivo  13000         8.0
3     Oppo  11000         7.0
4  Samsung  11500         6.0
5    Apple  12400         3.0
6       MI  15000         9.0

In [62]:
dm = d["Price"].mean()

In [63]:
d["Rating(10)"].mean()

6.642857142857143

In [64]:
d["Price"].fillna(dm)

0    12000
1    12500
2    13000
3    11000
4    11500
5    12400
6    15000
Name: Price, dtype: int64